#include "»гра.h"

#include "../–есерсы/–есурсныйћенеджер.h"
#include "../–ендор/—прайт.h"
#include "../–ендор/јнимаци€—прайт.h"
#include "../–ендор/Ўейдерна€ѕрограмма.h"
#include "../–ендор/“екстуры2D.h"

#include "»гровыеќбъекты/“анк.h"
#include "”ровень.h"

#include <GLFW/glfw3.h>
#include<glm/gtc/matrix_transform.hpp>
#include <glm/mat4x4.hpp>
#include <iostream>

int a=1;
»гра::»гра(const  glm::ivec2& window–азмер)
	:п_п“екущий»гры—осто€ние(ѕ»гры—осто€ние::јктивный)
    ,п_window–азмер(window–азмер)
{
	п_клавы.fill(false);
}
»гра::~»гра()
{

}

void »гра::воспроизводить()
{  
    if (п_ѕ”ровень)
    {
        п_ѕ”ровень->рендор();
    }
   
    //–есурсныйћенеджер::получатьјнимаци€—прайт(" јнимаци€—прайт")->отопрожение—пра();
    if (a == 1)
    {
        if (п_ѕ“анк)
        {
            п_ѕ“анк->рендор();

        }
       
    }
    else if(a==2)
    {
        if (п_ѕ“анк1)
        {
            п_ѕ“анк1->рендор();

        }
       
    }
   
   
}


void »гра::ќбновить(const uint64_t дельта)
{
    if (п_ѕ”ровень)
    {
        п_ѕ”ровень->обновить(дельта);
    }
   // –есурсныйћенеджер::получатьјнимаци€—прайт(" јнимаци€—прайт")->ќбновить(дельта);
    if (п_ѕ“анк&&п_ѕ“анк1)
    {
        if (п_клавы[GLFW_KEY_W])
        {  
            a = 1;
            п_ѕ“анк1->двигатьс€(true);
            п_ѕ“анк1->сохранитьќриентаци€Ѕез—прайта(“анк::ќриентаци€::¬ерх);
            п_ѕ“анк->сохранитьќриентаци€(“анк::ќриентаци€::¬ерх);
            п_ѕ“анк->двигатьс€(true);
           
            
        }
        else if(п_клавы[GLFW_KEY_A])
        {
            a = 2;
           
            п_ѕ“анк->сохранитьќриентаци€Ѕез—прайта(“анк::ќриентаци€::Ћево);
            п_ѕ“анк->двигатьс€(true);
            п_ѕ“анк1->двигатьс€(true);
            п_ѕ“анк1->сохранитьќриентаци€(“анк::ќриентаци€::Ћево);
        }
        else if (п_клавы[GLFW_KEY_D])
        {
            a = 2;
            
            п_ѕ“анк->сохранитьќриентаци€Ѕез—прайта(“анк::ќриентаци€::ѕраво);
            п_ѕ“анк->двигатьс€(true);
           п_ѕ“анк1->двигатьс€(true);
            п_ѕ“анк1->сохранитьќриентаци€(“анк::ќриентаци€::ѕраво);
        }
        else if (п_клавы[GLFW_KEY_S])
        {
            a = 1;
            п_ѕ“анк1->двигатьс€(true);
            п_ѕ“анк1->сохранитьќриентаци€Ѕез—прайта(“анк::ќриентаци€::¬низ);
            п_ѕ“анк->сохранитьќриентаци€(“анк::ќриентаци€::¬низ);
            п_ѕ“анк->двигатьс€(true);
           
        }
        else
        {
           
            п_ѕ“анк->двигатьс€(false);
            п_ѕ“анк1->двигатьс€(false);
        }

        п_ѕ“анк->обновить(дельта);
        п_ѕ“анк1->обновить(дельта);

    }
    
}

void »гра::установить нопку(const int клава, const int действовать)
{
	п_клавы[клава] = действовать;
}

bool »гра::инициализаци€()
{
    –есурсныйћенеджер::загрускаJSON–есурсов("ресерсы/ресерсы.json");

    auto загрузить—прайтЎейдонуюѕрограму = –есурсныйћенеджер::получатьЎудоровѕрограмм("загруска—прайтЎедоры");
  if (!загрузить—прайтЎейдонуюѕрограму)
    {
      std::cerr << "Ќе могу шейдоную програму: " << "загруска—прайтЎедоры" << std::endl;
      return false;
    }
   /* std::vector<std::string> расположение“екстур»м€ = { "¬зрыв0","¬зрыв1","¬зрыв2","¬зрыв3","¬зрыв4","¬зрыв5","¬зрыв6","¬зрыв7", "¬зрыв8", "¬зрыв9",  "¬зрыв10",  "¬зрыв11",  "¬зрыв12",  "¬зрыв13",  "¬зрыв14",  "¬зрыв15",  "¬зрыв16",  "¬зрыв17",  "¬зрыв18",  "¬зрыв19",  "¬зрыв20",  "¬зрыв21",  "¬зрыв22",  "¬зрыв23",  "¬зрыв24",  "¬зрыв25",  "¬зрыв26",  "¬зрыв27",  "¬зрыв28",  "¬зрыв29",  "¬зрыв30",  "¬зрыв31",  "¬зрыв32", };
    auto п“екстурјтлос = –есурсныйћенеджер::загруска“екстурјтлос("ѕоумолчанию“екстурјтлос", "ресерсы/текстуры/боевые танки.png", std::move(расположение“екстур»м€), 158, 120);

    auto пјнимаци€—прайт = –есурсныйћенеджер::загрускајнимаци€—прайт(" јнимаци€—прайт", "ѕоумолчанию“екстурјтлос", "загруска—прайтЎедоры", 100, 100, "¬зрыв0");
    пјнимаци€—прайт->сохранитьѕозицию(glm::vec2(300, 300));
            
    std::vector < std::pair < std::string, uint64_t>> взрыв—осто€ние;
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв0", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв1", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв2", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв3", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв4", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв5", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв6", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв7", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв8", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв9", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв10", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв11", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв12", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв13", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв14", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв15", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв16", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв17", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв18", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв19", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв20", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв21", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв22", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв23", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв24", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв25", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв26", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв27", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв28", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв29", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв30", 50000000));
    взрыв—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв31", 50000000));



    std::vector < std::pair < std::string, uint64_t>> взрыв2—осто€ние;
    взрыв2—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв4", 1000000000));
    взрыв2—осто€ние.emplace_back(std::make_pair<std::string, uint64_t>("¬зрыв5", 1000000000));

    пјнимаци€—прайт->вставить—осто€ние("взрыв—осто€ние", std::move(взрыв—осто€ние));
    пјнимаци€—прайт->вставить—осто€ние("взрыв2—осто€ние", std::move(взрыв2—осто€ние));


    пјнимаци€—прайт->сохранить—осто€ние("взрыв—осто€ние");*/
  auto п“анк“екстурјтлос = –есурсныйћенеджер::получать“екстуры2D("“анк“екстурјтлос");
  if (!п“анк“екстурјтлос)
  {
      std::cerr << "Ќе могу текстур атлос: " << "“анк“екстурјтлос" << std::endl;
      return false;
  }
 

   


    glm::mat4 проекци€ћатриц = glm::ortho(0.f, static_cast<float>(п_window–азмер.x), 0.f, static_cast<float>(п_window–азмер.y), -100.f, 100.f);


    загрузить—прайтЎейдонуюѕрограму->вкл();
    загрузить—прайтЎейдонуюѕрограму->сохраниеть«начение("ацй", 0);
    загрузить—прайтЎейдонуюѕрограму->сохранитьћатрицу4("projectionMat", проекци€ћатриц);

    auto п“анкјнимаци€—прайт = –есурсныйћенеджер::получатьјнимаци€—прайт("“анкјнимаци€—прайт");
    auto п“анкјнимаци€—прайт1 = –есурсныйћенеджер::получатьјнимаци€—прайт("“анкјнимаци€—прайт1");

    if (!п“анкјнимаци€—прайт && !п“анкјнимаци€—прайт1)
    {
        std::cerr << "Ќе могу анимаци€ спрайт: " << "“анкјнимаци€—прайт или “анкјнимаци€—прайт1" << std::endl;
        return false;
    }
    п_ѕ”ровень = std::make_unique<”ровень>(–есурсныйћенеджер::получить”ровени()[0]);

    п_ѕ“анк = std::make_unique<“анк>(п“анкјнимаци€—прайт, 0.0000001f, glm::vec2(0),glm::vec2(60.f, 100.f));
    п_ѕ“анк1 = std::make_unique<“анк>(п“анкјнимаци€—прайт1, 0.0000001f, glm::vec2(0),glm::vec2(100.f, 60.f));
  
    
    return true;

}